import random
sex = ["Жінка", "Чоловік"]

profession = {"Електрик", "Кухар", "Механік", "Технік з обслуговування обладнання", "Кравець", "Будівельник", "Гідролог", "Агроном", "Ветеринар", "Хімік", "Лісник", "Туристичний гід", "Фармацевт", "Психолог", "Метеоролог", "Шеф-кухар", "Біолог", "Програміст", "Мистецтвознавець", "Реабілітолог", "Кур’єр", "Дизайнер інтер’єрів", "Інженер з безпеки", "Журналіст", "Архіваріус", "Директор з логістики", "Менеджер з постачання", "Соціальний працівник", "Актуарій", "Тренер із фізичної підготовки", "Пенсіонер", "Тільки студент", "Безробітний", "Доктор", "Інженер", "Викладач", "Архітектор", "Механік", "Програміст", "Міський планувальник", "Фермер", "Актор", "Юрист"}
hobi = {"Не має жодного хобі", "Захоплюється лише гаджетами і не може без них жити", "Постійно вживає алкоголь", "Не любить фізичну активність", "Завжди сидить вдома", "Не вміє нічого робити руками", "Залежний від соціальних мереж", "Багато часу витрачає на ігри", "Занадто багато часу проводить у розвагах, мало чим корисним займається", "Не має інтересу до навчання", "Читання книг", "Малювання", "Спортивні ігри", "Кулінарія", "Туризм", "Музика", "Ігри на комп'ютері", "Риболовля", "Фотографія", "В'язання"}

bagazh = {"Пластмасова квітка", "М'яч для футболу", "Невеликий тедді-бір", "Гігантський надувний круг", "Фігурка Діда Мороза", "Магніт на холодильник", "Розкішний парасолька без ручки", "Гарнітури для караоке", "Велика банка маринованих огірків без кришки", "Порожній портфель", "Картонний плакат з рекламою", "Невикористовувані пластикові стаканчики", "Велика колекція пляшок з різними видами води", "Різнокольорові стрічки", "Порожня коробка для взуття", "Чохол для мобільного без телефону", "Ручний вентилятор без батарейок", "Термометр без шкали", "Шарф без шапки", "Листівки без адреси", "Чайник без свистка", "Ремінь без пряжки", "Набір для малювання без фарб", "Рукавички без пальців", "Міні-лампа без лампочки", "Батарейки без позначок", "Набір для першої допомоги", "Фляга з водою", "Рюкзак з їжею на тиждень", "Мобільний телефон з зарядним пристроєм", "Набір для розпалювання вогню", "Комплект зимового одягу", "Мультитул", "Фонарь", "Мапа місцевості", "Батарейки", "Ніж для виживання", "Запасна пара черевиків", "Набір для шиття", "Моток дроту", "Термоковдра", "Паливо для генератора", "Таблетки для очищення води", "Компактна рація", "Сітка для риболовлі", "Шоколадні батончики", "Складні лопата і совок", "Карта з рятувальними маршрутами", "Теплий спальний мішок", "Туристична плита", "Зарядний пристрій для автомобіля", "Канапка для хворих", "Резервні аптечні засоби", "Теплоізоляційна стрічка", "Пластикові контейнери для зберігання їжі","Медикаменти", "Книжка", "Генератор", "Насіння рослин", "Консерви", "Карта місцевості", "Ліхтарик", "Мобільний телефон","Бінти", "Рюкзак", "Спальник","Велика упаковка чаю", "Котушка ниток", "Ножиці", "Батарейки", "Сірники", "Термометр", "Лопата", "Великий запас води", "Медичні маски", "Кавоварка", "Печиво", "Складний ніж", "Газовий балон", "Рибальські снасті", "Складаний стілець", "Термос", "Пластикові контейнера", "Газовий пальник", "Пакет з сухпайком", "Захисні окуляри", "Компас", "Керівництво з виживання", "Мікрофон", "Протигаз", "Парасолька", "Газета", "Фотоапарат", "Товсті рукавички", "Кілька коробок сірників", "Паяльник", "М'яч для футболу", "Невеликий тедді-бір", "Гігантський надувний круг", "Магніт на холодильник", "Розкішний парасолька без ручки", "Гарнітури для караоке", "Велика банка маринованих огірків ", "Велика колекція пляшок з різними видами води", "Ручний вентилятор без батарейок", "Набір для першої допомоги", "Фляга з водою", "Рюкзак з їжею на тиждень", "Мобільний телефон з зарядним пристроєм", "Набір для розпалювання вогню", "Комплект зимового одягу", "Мультитул", "Мапа місцевості", "Батарейки", "Ніж для виживання", "Набір для шиття", "Моток дроту", "Термоковдра", "Паливо для генератора", "Таблетки для очищення води", "Компактна рація", "Сітка для риболовлі", "Шоколадні батончики", "Теплий спальний мішок", "Туристична плита", "Зарядний пристрій для автомобіля", "Резервні аптечні засоби", "Теплоізоляційна стрічка", "Річний запас їжі", "Валіза із колекцією сирів"}

heal = {"Серйозні хронічні захворювання", "Алергія на їжу в запасах", "Постійні головні болі", "Потребує постійного прийому ліків", "Не може довго ходити або стояти", "Має важкі психічні проблеми", "Не здатен до фізичних навантажень", "Має серйозні травми, що не загоюються", "Вразливий до інфекцій", "Слабкий і часто захворює", "Хронічні хвороби", "Поганий зір", "Алергія на пилок", "Травма ноги", "Респіраторне захворювання", "Інвалідність", "Поганий слух", "Інфекція", "Психічні проблеми"}
fakti = {"Немає важливих досягнень", "Не має жодного досвіду виживання", "Не може адекватно реагувати на стрес", "Не володіє жодними корисними навичками", "Ніколи не працював в команді", "Погано орієнтується в екстрених ситуаціях", "Не вміє приймати важливі рішення", "Має проблеми з психічним здоров'ям", "Завжди боїться приймати на себе відповідальність","Володар нагороди за хоробрість", "Став свідком великої катастрофи", "Викладач університету", "Пройшов медичну практику в кризових ситуаціях", "Має власний сад", "Семейний стан: одружений, 2 дітей", "Має досвід виживання в екстремальних умовах", "Колишній військовий", "Понад 10 років працював у психології", "Знавці історії давнього світу"}
bunker = {"Мало місця для всіх", "Система вентиляції часто не працює", "Бункер має погане освітлення", "Відсутність гарячої води", "Немає доступу до електрики", "Відсутня система опалення в зимовий час", "Погана ізоляція від зовнішнього світу", "Не вистачає місця для важливих запасів", "Складно підтримувати чистоту в бункері", "Немає базових зручностей, таких як туалет", "Немає доступу до інтернету", "Обмежена кількість їжі", "Потрібен постійний моніторинг стану здоров'я", "Забезпечено постійне теплопостачання", "Не вистачає місця для всіх", "Є обмеження на кількість людей", "Потрібно постійно підтримувати зв'язок з зовнішнім світом", "Немає постачання води", "Немає ліфтів, лише сходи", "Інтер’єр бункера потребує ремонту"}

def gen_profession():
    return list(profession)[random.randint(0, len(profession)-1)]

def gen_hobi():
    return list(hobi)[random.randint(0, len(hobi)-1)]

def gen_bagazh():
    return list(bagazh)[random.randint(0, len(bagazh)-1)]

def gen_heal():
    if random.randint(0,1):
        return list(heal)[random.randint(0, len(heal)-1)]
    return "Повністю здоровий"

def gen_fakti():
    return list(fakti)[random.randint(0, len(fakti)-1)]

def gen_bunker():
    return list(bunker)[random.randint(0, len(bunker)-1)]

class Person:

    def __init__(self, _id, username):
        self.id = _id
        self.username = username
        self.profession = gen_profession()
        self.hobi = gen_hobi()
        self.bagazh = gen_bagazh()
        self.heal = gen_heal()
        self.fakti = gen_fakti()
        self.bunker = gen_bunker()
        self.biology = f"{sex[random.randint(0,1)]}, {random.randint(12,70)}"

    def get(self):
        return {
        "id" : self.id,
        "username" : self.username,
        "profession" : self.profession,
        "hobi": self.hobi,
        "bagazh" : self.bagazh,
        "heal" : self.heal,
        "fakti" : self.fakti,
        "bunker" : self.bunker,
        "biology" : self.biology}